import { Component } from '@angular/core';

@Component({
  selector: 'app-questions-answers',
  imports: [],
  templateUrl: './questions-answers.component.html',
  styleUrl: './questions-answers.component.scss'
})
export class QuestionsAnswersComponent {
 selectedIndex: number | null = 0;

 faqs = [  {
    question:"אני עם הרו''ח שלי כבר 20 שנה , למה להחליף?",
    answer: `1. מאותה סיבה שאתה מחליף רכב כל 4-5 שנים, אתה רוצה להתקדם ולשפר את איכות החיים שלך , אתה רוצה נסיעה חלקה יותר, רכב מרווח וחזק יותר, גם אני החלפתי אופנוע לאופנוע גדול וחזק יותר , אין מילים חווית נהיגה אחרת לגמרי.
<br>
2. אולי במשך 20 שנה טעית? אולי אצלי תקבל ייעוץ עסקי והכוונה מקצועית טובה הרבה יותר שתחסוך לך אלפי שקלים בשנה ? אולי יש לי תכנוני מס \ הקלות בניהול ספרים תכנוני שכר ייצוג מול ביטוח לאומי ברמה שאתה לא מכיר ? וזה מעבר לערך המוסף, בצורה של שירות שליחויות , מתן עדכונים שוטפים על גובה הכנסות, עדכוני חקיקה חשובים, פרסום מאמרים מקצועיים, אתר אינטרנט מלא בתוכן איכותי ומקצועי ועוד…
<br>
3. יש לי לא מעט לקוחות שהיו אצל הרו"ח שלהם במשך 15-20 שנה ויותר, ועברו אליי בשנים האחרונות – אשמח לתת לך את מספרי הטלפון שלהם, ותברר לבד.
<br>
4. אני מבין את החששות שלך, כי להרגל יש כוח, אי אפשר להתעלם מזה, ולפעמים גם מהרגלים רעים כמו עישון ושתיה קשה מאוד להיגמל, יחד עם זאת, כשיודעים שעושים שינוי לטובה , שבסופו של יום יעשה לך רק טוב, אז שווה את אי הנוחות הזמנית שיש בהתחלה.
<br>
5. יש לי לקוחות שבדו"ח השנתי הראשון שהכנתי להם חסכתי להם 10,000 ₪ , לפעמים שווה להרגיש קצת אי נוחות 🙂
<br>
6. הניסיון מלמד כי אנשי מקצוע שעוסקים הרבה שנים בתחום כל כך דינמי כמו מיסים, שכל שעתיים בערך קיים בו תיקוני חקיקה פסקי דין וכ"ו , נשארים מאחור בסופו של היום בהיבט המקצועי,
<br>
7. גם בהיבט הטכנולוגי, אני יכול לומר לך שאחת הבעיות הגדולות של אנשי המקצוע ראיית החשבון וייעוץ מס הוא האתגר הטכנולוגי, כיום כל הדיווחים הפכו לממוחשבים, כל החוזרים המקצועיים מגיעים במיילים או מתעדכנים באתרי האינטרנט – ויש לי המון קולגות שתקועים חזק בעבר, עובדה שעושה נזק גם לעצמם וגם ללקוחות שלהם. אני יכול לשתף אותך במקרה קלאסי שקרה לי שלקוחה שעברה אליי, הביאה את תיק הנהלת החשבונות שלה, אתה פשוט רואה שהרו"ח שלה לא היה מחובר למערכת לייצוג לקוחות ברשות המיסים וביטוח לאומי- והתעדכן כמו הלקוחה שלו דרך מכתבי גביה ואיומים מרשות המיסים – שידוע שבהמון מקרים מדובר על איומי סרק – בעוד אני יכול לתת מענה ברמת ה30 שניות לכל שאלה שלך או אירוע שמתרחש בתיק שלך מול רשויות מס הכנסה ביטוח לאומי ומע"מ.`
  },
  {
    question: 'יש לי הכנסה ממש קטנה, למה בכלל לפתוח תיק במס הכנסה?',
    answer: `דווקא הכנסה קטנה היא קריטית להסדרה מוקדמת – כי ברגע שאתה פותח תיק כחוק, אתה יכול ליהנות מהטבות מס, להוציא חשבוניות ולהתחיל לפעול באופן חוקי. אחרת, אתה חשוף לקנסות, חקירות והשלכות בעתיד.`
  },
  {
    question: 'אני עוסק פטור – למה אני צריך יועץ מס?',
    answer: `יועץ מס יודע לזהות טעויות ולבנות לך אסטרטגיה שתתאים לעסק שלך. עוסק פטור שנעזר ביועץ חכם יכול להימנע מטעויות קריטיות כמו חישוב מס שגוי, ניהול תזרים לקוי או חובות לביטוח לאומי.`
  },
  {
    question: 'מה ההבדל בין עוסק פטור לעוסק מורשה – ומה מתאים לי?',
    answer: `עוסק פטור מתאים לבעלי הכנסה נמוכה יחסית, אבל עוסק מורשה נותן לך מראה עסקי מתקדם יותר ומאפשר קיזוז מע”מ. הבחירה תלויה באופי ההכנסות שלך ובמטרות שלך – כאן יועץ מס מנוסה נכנס לתמונה.`
  },
  {
    question: 'אני כבר עובד מהבית – למה בכלל צריך לדווח או להוציא חשבוניות?',
    answer: `עצמאי שלא מדווח מסכן את עצמו משפטית – אבל גם מפסיד החזרים והכרה בהוצאות כמו אינטרנט, חשמל, שכירות ואפילו חלק מהרכב. דיווח נכון = כסף שמגיע לך בחזרה.`
  },
  {
    question: 'כמה מס באמת אני הולך לשלם כעצמאי?',
    answer: `עם תכנון נכון – אתה עלול לשלם פחות ממה שאתה חושב. יועץ מס טוב יודע לנצל פטורים, נקודות זיכוי, הטבות לעצמאים ולמשפחות. בניהול נכון – גם עצמאי קטן יכול להרוויח יותר ולשלם פחות.`
  },
  {
    question: 'אני חדש בתחום. מתי בכלל מתחילים להגיש דו”חות?',
    answer: `מיד כשמתחילים לקבל כסף. אין “תקופת חסד”. כדאי להסדיר תיק לפני שמתחילים – כי גם רטרואקטיבית, זה יכול להיחשב כהעלמת מס. ככל שתתחיל מוקדם יותר – תשלוט יותר.`
  }
];


  toggle(index: number) {
    this.selectedIndex = this.selectedIndex === index ? null : index;
  }
}
